### Report for suspension-service

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- suspension-service in modules/suspension-service
Initializing provider plugins...
- Finding hashicorp/aws versions matching "5.59.0"...
- Finding latest version of hashicorp/archive...
- Installing hashicorp/archive v2.7.1...
- Installed hashicorp/archive v2.7.1 (signed by HashiCorp)
- Installing hashicorp/aws v5.59.0...
- Installed hashicorp/aws v5.59.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan ()</summary>

```

module.suspension-service.data.archive_file.lambda: Reading...
module.suspension-service.data.archive_file.lambda: Read complete after 0s [id=a40735bd0ae66a3ce86b1c5f02a7ad3f9a0261f6]
data.aws_ssm_parameter.environment_domain_name: Reading...
module.suspension-service.data.aws_iam_policy_document.assume_role: Reading...
module.suspension-service.data.aws_s3_bucket.access_logs: Reading...
data.aws_ssm_parameter.safe_listed_ods_codes: Reading...
module.suspension-service.data.aws_ssm_parameter.suspensions_sns_topic_arn: Reading...
data.aws_ssm_parameter.deductions_private_private_subnets: Reading...
data.aws_ssm_parameter.repo_ods_code: Reading...
data.aws_ssm_parameter.deductions_private_db_subnets: Reading...
data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.pds_adaptor_auth_key: Reading...
module.suspension-service.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
data.aws_caller_identity.current: Read complete after 0s [id=[REDACTED_AWS_ACCOUNT_ID]]
data.aws_ssm_parameter.deductions_private_db_subnets: Read complete after 0s [id=/repo/dev/output/prm-deductions-infra/deductions-private-database-subnets]
module.suspension-service.data.aws_ssm_parameter.suspensions_sns_topic_arn: Read complete after 0s [id=/repo/dev/output/nems-event-processor/suspensions-sns-topic-arn]
data.aws_ssm_parameter.dynamodb_prefix_list_id: Reading...
data.aws_ssm_parameter.s3_prefix_list_id: Reading...
data.aws_ssm_parameter.safe_listed_ods_codes: Read complete after 0s [id=/repo/dev/user-input/external/safe-listed-ods-codes]
data.aws_iam_policy_document.kms_policy_doc: Reading...
data.aws_iam_policy_document.kms_policy_doc: Read complete after 1s [id=2252110784]
data.aws_iam_policy_document.sns_service_assume_role_policy: Reading...
data.aws_iam_policy_document.sns_service_assume_role_policy: Read complete after 0s [id=318828377]
data.aws_iam_policy_document.sns_failure_feedback_policy: Reading...
data.aws_iam_policy_document.sns_failure_feedback_policy: Read complete after 0s [id=3494271637]
data.aws_ssm_parameter.deductions_private_private_subnets: Read complete after 1s [id=/repo/dev/output/prm-deductions-infra/deductions-private-private-subnets]
module.suspension-service.data.aws_ssm_parameter.suspensions_kms_key_id: Reading...
data.aws_iam_policy_document.cloudwatch_metrics_policy_doc: Reading...
data.aws_iam_policy_document.cloudwatch_metrics_policy_doc: Read complete after 0s [id=3149000521]
data.aws_ssm_parameter.repo_ods_code: Read complete after 1s [id=/repo/dev/user-input/external/repository-ods-code]
module.suspension-service.data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.ecs-assume-role-policy: Reading...
data.aws_iam_policy_document.ecs-assume-role-policy: Read complete after 0s [id=1077804475]
data.aws_ssm_parameter.pds_adaptor_auth_key: Read complete after 1s [id=/repo/dev/user-input/api-keys/pds-adaptor/suspension-service]
data.aws_ssm_parameter.environment_domain_name: Read complete after 1s [id=/repo/dev/output/prm-deductions-infra/environment-domain-name]
data.aws_sns_topic.alarm_notifications: Reading...
data.aws_ssm_parameter.deductions_private_vpc_id: Reading...
module.suspension-service.data.aws_sns_topic.alarm_notifications: Reading...
data.aws_ssm_parameter.s3_prefix_list_id: Read complete after 1s [id=/repo/dev/output/prm-deductions-infra/s3_prefix_list_id]
data.aws_ssm_parameter.dynamodb_prefix_list_id: Read complete after 1s [id=/repo/dev/output/prm-deductions-infra/dynamodb_prefix_list_id]
data.aws_iam_policy_document.kms_key_policy_doc: Reading...
data.aws_iam_policy_document.kms_key_policy_doc: Read complete after 0s [id=220216613]
module.suspension-service.data.aws_caller_identity.current: Read complete after 0s [id=[REDACTED_AWS_ACCOUNT_ID]]
module.suspension-service.data.aws_ssm_parameter.suspensions_kms_key_id: Read complete after 0s [id=/repo/dev/output/prm-deductions-nems-event-processor/suspensions-kms-key-id]
data.aws_ssm_parameter.deductions_private_vpc_id: Read complete after 0s [id=/repo/dev/output/prm-deductions-infra/private-vpc-id]
module.suspension-service.data.aws_s3_bucket.access_logs: Read complete after 1s [id=dev-orc-access-logs]
data.aws_iam_policy_document.ecr_policy_doc: Reading...
data.aws_iam_policy_document.ecr_policy_doc: Read complete after 0s [id=1289991967]
data.aws_iam_policy_document.logs_policy_doc: Reading...
data.aws_iam_policy_document.logs_policy_doc: Read complete after 0s [id=1671441502]
data.aws_sns_topic.alarm_notifications: Read complete after 0s [id=arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-alarm-notifications-sns-topic]
module.suspension-service.data.aws_sns_topic.alarm_notifications: Read complete after 0s [id=arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-alarm-notifications-sns-topic]
module.suspension-service.data.aws_iam_policy_document.kms_key_policy_doc: Reading...
module.suspension-service.data.aws_iam_policy_document.kms_key_policy_doc: Read complete after 0s [id=220216613]
data.aws_vpc.private_vpc: Reading...
data.aws_vpc.private_vpc: Read complete after 1s
data.aws_iam_policy_document.invalid_suspension_policy_doc: Reading...
data.aws_iam_policy_document.invalid_suspension_policy_doc: Read complete after 0s [id=1269810183]
data.aws_iam_policy_document.dynamodb-table-access: Reading...
data.aws_iam_policy_document.dynamodb-table-access: Read complete after 0s [id=357627877]
data.aws_iam_policy_document.non_sensitive_deceased_policy_doc: Reading...
data.aws_iam_policy_document.non_sensitive_deceased_policy_doc: Read complete after 0s [id=263588728]
data.aws_iam_policy_document.mof_not_updated_events_policy_doc: Reading...
data.aws_iam_policy_document.mof_not_updated_events_policy_doc: Read complete after 0s [id=2543744117]
data.aws_iam_policy_document.invalid_suspension_audit_policy_doc: Reading...
data.aws_iam_policy_document.invalid_suspension_audit_policy_doc: Read complete after 0s [id=4113059901]
data.aws_iam_policy_document.event_out_of_order_policy_doc: Reading...
data.aws_iam_policy_document.event_out_of_order_policy_doc: Read complete after 0s [id=2807351255]
data.aws_iam_policy_document.mof_updated_events_policy_doc: Reading...
data.aws_iam_policy_document.mof_updated_events_policy_doc: Read complete after 0s [id=1589586365]
data.aws_iam_policy_document.not_suspended_events_policy_doc: Reading...
data.aws_iam_policy_document.not_suspended_events_policy_doc: Read complete after 0s [id=550809123]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_iam_policy_document.sns_policy_doc will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sns_policy_doc" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:GetTopicAttributes",
              + "sns:Publish",
            ]
          + resources = [
              + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-active-suspensions-sns-topic",
              + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-deceased-patient",
              + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-event-out-of-order",
              + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-audit-sns-topic",
              + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-sns-topic",
              + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated-sns-topic",
              + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated-sns-topic",
              + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-sns-topic",
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.sqs_suspensions_ecs_task will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sqs_suspensions_ecs_task" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:ChangeMessageVisibility",
              + "sqs:DeleteMessage",
              + "sqs:GetQueue*",
              + "sqs:ReceiveMessage",
            ]
          + resources = [
              + "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-deceased-patient",
              + "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-dlq",
              + "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-dlq-audit",
              + "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated",
              + "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated-audit",
              + "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated",
              + "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated-audit",
              + "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-audit",
              + "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-observability",
              + (known after apply),
            ]
        }
    }

  # aws_ecs_service.ecs-service will be updated in-place
  ~ resource "aws_ecs_service" "ecs-service" {
        id                                 = "arn:aws:ecs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:service/dev-suspension-service-ecs-cluster/dev-suspension-service"
        name                               = "dev-suspension-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:task-definition/suspension-service:445" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:task-definition/suspension-service:445" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:task-definition/suspension-service" -> (known after apply)
      - container_definitions    = (sensitive value) -> null # forces replacement
      ~ id                       = "suspension-service" -> (known after apply)
      ~ revision                 = 445 -> (known after apply)
        tags                     = {
            "CreatedBy"   = "suspension-service"
            "Environment" = "dev"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_iam_policy.suspension_service_sns will be updated in-place
  ~ resource "aws_iam_policy" "suspension_service_sns" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/dev-suspension-service-sns"
        name             = "dev-suspension-service-sns"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sns:Publish",
                          - "sns:GetTopicAttributes",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-repo-incoming",
                          - "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-sns-topic",
                          - "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated-sns-topic",
                          - "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated-sns-topic",
                          - "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-sns-topic",
                          - "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-audit-sns-topic",
                          - "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-event-out-of-order",
                          - "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-deceased-patient",
                          - "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-active-suspensions-sns-topic",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.suspensions_processor_sqs will be updated in-place
  ~ resource "aws_iam_policy" "suspensions_processor_sqs" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/dev-suspension-service-sqs"
        name             = "dev-suspension-service-sqs"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueue*",
                          - "sqs:DeleteMessage",
                          - "sqs:ChangeMessageVisibility",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-suspensions",
                          - "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-observability",
                          - "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-audit",
                          - "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated-audit",
                          - "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated",
                          - "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated-audit",
                          - "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated",
                          - "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-dlq-audit",
                          - "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-dlq",
                          - "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-deceased-patient",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.suspension-service.data.aws_iam_policy_document.repo_incoming_observability_topic_access_to_queue will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "repo_incoming_observability_topic_access_to_queue" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.suspension-service.data.aws_iam_policy_document.suspensions_sns_topic_access_to_queue will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "suspensions_sns_topic_access_to_queue" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.suspension-service.aws_cloudwatch_metric_alarm.suspensions_queue_age_of_message will be created
  + resource "aws_cloudwatch_metric_alarm" "suspensions_queue_age_of_message" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-alarm-notifications-sns-topic",
        ]
      + alarm_description                     = "Alarm to alert approximate time for message in the queue"
      + alarm_name                            = "dev-suspension-service-queue-age-of-message"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "dev-suspension-service-suspensions"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = [
          + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-alarm-notifications-sns-topic",
        ]
      + period                                = 1800
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 86400
      + treat_missing_data                    = "missing"
    }

  # module.suspension-service.aws_iam_policy.ingestion_bucket_get_object_policy will be created
  + resource "aws_iam_policy" "ingestion_bucket_get_object_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-ehr-ingestion_get_object_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.suspension-service.aws_iam_policy.suspensions_queue_send_message_policy will be created
  + resource "aws_iam_policy" "suspensions_queue_send_message_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.suspension-service.aws_iam_role.lambda_execution_role will be created
  + resource "aws_iam_role" "lambda_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev_lambda_execution_role_orc_ingestion"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.suspension-service.aws_iam_role_policy_attachment.lambda_execution_policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_execution_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "dev_lambda_execution_role_orc_ingestion"
    }

  # module.suspension-service.aws_iam_role_policy_attachment.lambda_execution_policy[1] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_execution_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "dev_lambda_execution_role_orc_ingestion"
    }

  # module.suspension-service.aws_iam_role_policy_attachment.lambda_execution_policy[2] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_execution_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev_lambda_execution_role_orc_ingestion"
    }

  # module.suspension-service.aws_iam_role_policy_attachment.lambda_execution_policy[3] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_execution_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev_lambda_execution_role_orc_ingestion"
    }

  # module.suspension-service.aws_kms_alias.repo_incoming_encryption will be created
  + resource "aws_kms_alias" "repo_incoming_encryption" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/suspension-service-repo-incoming-encryption-kms-key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.suspension-service.aws_kms_key.repo_incoming will be created
  + resource "aws_kms_key" "repo_incoming" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "Custom KMS Key to enable server side encryption for repo incoming topic"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:root"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "sns.amazonaws.com"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudwatch.amazonaws.com"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "CreatedBy"   = "suspension-service"
          + "Environment" = "dev"
          + "Name"        = "dev-repo-incoming-kms-key"
        }
      + tags_all                           = {
          + "CreatedBy"   = "suspension-service"
          + "Environment" = "dev"
          + "Name"        = "dev-repo-incoming-kms-key"
        }
    }

  # module.suspension-service.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./../../../lambdas/orc-ingestion-lambda/build/orc_ingestion_payload.zip"
      + function_name                  = "dev_orc_ingestion"
      + handler                        = "orc_ingestion.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "z0EpdZpiB+WDtVLFmX8Asr5l2Vp4fm09pG9HzZ1a8PY="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.suspension-service.aws_s3_bucket.ingestion_bucket will be created
  + resource "aws_s3_bucket" "ingestion_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "dev-ehr-ingestion"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "dev-ehr-ingestion"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Name"        = "dev-ehr-ingestion"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.suspension-service.aws_s3_bucket_logging.ingestion_bucket will be created
  + resource "aws_s3_bucket_logging" "ingestion_bucket" {
      + bucket        = (known after apply)
      + id            = (known after apply)
      + target_bucket = "dev-orc-access-logs"
      + target_prefix = "dev-ehr-ingestion/"
    }

  # module.suspension-service.aws_s3_bucket_policy.ingestion_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "ingestion_bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.suspension-service.aws_s3_bucket_public_access_block.ingestion_bucket will be created
  + resource "aws_s3_bucket_public_access_block" "ingestion_bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "dev-ehr-ingestion"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.suspension-service.aws_s3_bucket_server_side_encryption_configuration.ingestion_bucket will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "ingestion_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.suspension-service.aws_sns_topic.repo_incoming will be created
  + resource "aws_sns_topic" "repo_incoming" {
      + arn                           = (known after apply)
      + beginning_archive_time        = (known after apply)
      + content_based_deduplication   = false
      + fifo_topic                    = false
      + id                            = (known after apply)
      + kms_master_key_id             = (known after apply)
      + name                          = "dev-suspension-service-repo-incoming"
      + name_prefix                   = (known after apply)
      + owner                         = (known after apply)
      + policy                        = (known after apply)
      + signature_version             = (known after apply)
      + sqs_failure_feedback_role_arn = "[REDACTED_IAM_ROLE_ARN]"
      + tags                          = {
          + "CreatedBy"   = "suspension-service"
          + "Environment" = "dev"
          + "Name"        = "dev-suspension-service-repo-incoming-sns-topic"
        }
      + tags_all                      = {
          + "CreatedBy"   = "suspension-service"
          + "Environment" = "dev"
          + "Name"        = "dev-suspension-service-repo-incoming-sns-topic"
        }
      + tracing_config                = (known after apply)
    }

  # module.suspension-service.aws_sns_topic_subscription.repo_incoming_observability_queue will be created
  + resource "aws_sns_topic_subscription" "repo_incoming_observability_queue" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = true
      + topic_arn                       = (known after apply)
    }

  # module.suspension-service.aws_sns_topic_subscription.suspensions_topic will be created
  + resource "aws_sns_topic_subscription" "suspensions_topic" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = true
      + topic_arn                       = (sensitive value)
    }

  # module.suspension-service.aws_sqs_queue.repo_incoming_observability_queue will be created
  + resource "aws_sqs_queue" "repo_incoming_observability_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "dev-suspension-service-repo-incoming-observability"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "CreatedBy"   = "suspension-service"
          + "Environment" = "dev"
          + "Name"        = "dev-suspension-service-repo-incoming-observability"
        }
      + tags_all                          = {
          + "CreatedBy"   = "suspension-service"
          + "Environment" = "dev"
          + "Name"        = "dev-suspension-service-repo-incoming-observability"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.suspension-service.aws_sqs_queue.suspensions will be created
  + resource "aws_sqs_queue" "suspensions" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = (sensitive value)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "dev-suspension-service-suspensions"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 20
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "CreatedBy"   = "suspension-service"
          + "Environment" = "dev"
          + "Name"        = "dev-suspension-service-suspensions"
        }
      + tags_all                          = {
          + "CreatedBy"   = "suspension-service"
          + "Environment" = "dev"
          + "Name"        = "dev-suspension-service-suspensions"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 240
    }

  # module.suspension-service.aws_sqs_queue_policy.repo_incoming_observability will be created
  + resource "aws_sqs_queue_policy" "repo_incoming_observability" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # module.suspension-service.aws_sqs_queue_policy.suspensions_subscription will be created
  + resource "aws_sqs_queue_policy" "suspensions_subscription" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # module.suspension-service.aws_ssm_parameter.repo_incoming_kms_key will be created
  + resource "aws_ssm_parameter" "repo_incoming_kms_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/repo/dev/output/suspension-service/repo-incoming-kms-key"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.suspension-service.aws_ssm_parameter.repo_incoming_topic_arn will be created
  + resource "aws_ssm_parameter" "repo_incoming_topic_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/repo/dev/output/suspension-service/repo-incoming-topic-arn"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.suspension-service.aws_ssm_parameter.suspensions_queue_arn will be created
  + resource "aws_ssm_parameter" "suspensions_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/repo/dev/output/suspension-service/suspensions-queue-arn"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.suspension-service.aws_ssm_parameter.suspensions_queue_name will be created
  + resource "aws_ssm_parameter" "suspensions_queue_name" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/repo/dev/output/suspension-service/suspensions-queue-name"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.suspension-service[0].aws_cloudwatch_metric_alarm.suspensions_queue_age_of_message will be destroyed
  # (because module.suspension-service[0] is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "suspensions_queue_age_of_message" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-alarm-notifications-sns-topic",
        ] -> null
      - alarm_description                     = "Alarm to alert approximate time for message in the queue" -> null
      - alarm_name                            = "dev-suspension-service-queue-age-of-message" -> null
      - arn                                   = "arn:aws:cloudwatch:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:alarm:dev-suspension-service-queue-age-of-message" -> null
      - comparison_operator                   = "GreaterThanThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {
          - "QueueName" = "dev-suspension-service-suspensions"
        } -> null
      - evaluation_periods                    = 1 -> null
      - id                                    = "dev-suspension-service-queue-age-of-message" -> null
      - insufficient_data_actions             = [] -> null
      - metric_name                           = "ApproximateAgeOfOldestMessage" -> null
      - namespace                             = "AWS/SQS" -> null
      - ok_actions                            = [
          - "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-alarm-notifications-sns-topic",
        ] -> null
      - period                                = 1800 -> null
      - statistic                             = "Maximum" -> null
      - tags                                  = {} -> null
      - tags_all                              = {} -> null
      - threshold                             = 86400 -> null
      - treat_missing_data                    = "missing" -> null
        # (4 unchanged attributes hidden)
    }

  # module.suspension-service[0].aws_iam_policy.ingestion_bucket_get_object_policy will be destroyed
  # (because module.suspension-service[0] is not in configuration)
  - resource "aws_iam_policy" "ingestion_bucket_get_object_policy" {
      - arn              = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/dev-ehr-ingestion_get_object_policy" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/dev-ehr-ingestion_get_object_policy" -> null
      - name             = "dev-ehr-ingestion_get_object_policy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::dev-ehr-ingestion/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAWCD5NRKJDPRTH3J2Y" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.suspension-service[0].aws_iam_policy.suspensions_queue_send_message_policy will be destroyed
  # (because module.suspension-service[0] is not in configuration)
  - resource "aws_iam_policy" "suspensions_queue_send_message_policy" {
      - arn              = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/terraform-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]02" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/terraform-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]02" -> null
      - name             = "terraform-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]02" -> null
      - name_prefix      = "terraform-" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sqs:SendMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-suspensions",
                        ]
                      - Sid      = "shsqsstatement"
                    },
                  - {
                      - Action   = [
                          - "kms:GenerateDataKey",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAWCD5NRKJEXR4PRBFT" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
        # (1 unchanged attribute hidden)
    }

  # module.suspension-service[0].aws_iam_role.lambda_execution_role will be destroyed
  # (because module.suspension-service[0] is not in configuration)
  - resource "aws_iam_role" "lambda_execution_role" {
      - arn                   = "[REDACTED_IAM_ROLE_ARN]" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-10-17T14:26:13Z" -> null
      - force_detach_policies = false -> null
      - id                    = "dev_lambda_execution_role_orc_ingestion" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/dev-ehr-ingestion_get_object_policy",
          - "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/terraform-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]02",
          - "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy",
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "dev_lambda_execution_role_orc_ingestion" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAWCD5NRKJF5PRNOGPJ" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
            name   = null
            # (1 unchanged attribute hidden)
        }
    }

  # module.suspension-service[0].aws_iam_role_policy_attachment.lambda_execution_policy[0] will be destroyed
  # (because module.suspension-service[0] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_execution_policy" {
      - id         = "dev_lambda_execution_role_orc_ingestion-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]04" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole" -> null
      - role       = "dev_lambda_execution_role_orc_ingestion" -> null
    }

  # module.suspension-service[0].aws_iam_role_policy_attachment.lambda_execution_policy[1] will be destroyed
  # (because module.suspension-service[0] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_execution_policy" {
      - id         = "dev_lambda_execution_role_orc_ingestion-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]03" -> null
      - policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy" -> null
      - role       = "dev_lambda_execution_role_orc_ingestion" -> null
    }

  # module.suspension-service[0].aws_iam_role_policy_attachment.lambda_execution_policy[2] will be destroyed
  # (because module.suspension-service[0] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_execution_policy" {
      - id         = "dev_lambda_execution_role_orc_ingestion-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]01" -> null
      - policy_arn = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/terraform-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]02" -> null
      - role       = "dev_lambda_execution_role_orc_ingestion" -> null
    }

  # module.suspension-service[0].aws_iam_role_policy_attachment.lambda_execution_policy[3] will be destroyed
  # (because module.suspension-service[0] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_execution_policy" {
      - id         = "dev_lambda_execution_role_orc_ingestion-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]02" -> null
      - policy_arn = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/dev-ehr-ingestion_get_object_policy" -> null
      - role       = "dev_lambda_execution_role_orc_ingestion" -> null
    }

  # module.suspension-service[0].aws_kms_alias.repo_incoming_encryption will be destroyed
  # (because module.suspension-service[0] is not in configuration)
  - resource "aws_kms_alias" "repo_incoming_encryption" {
      - arn            = "arn:aws:kms:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:alias/suspension-service-repo-incoming-encryption-kms-key" -> null
      - id             = "alias/suspension-service-repo-incoming-encryption-kms-key" -> null
      - name           = "alias/suspension-service-repo-incoming-encryption-kms-key" -> null
      - target_key_arn = "arn:aws:kms:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:key/8b7c08da-c7ee-4104-a623-3440f25999fc" -> null
      - target_key_id  = "8b7c08da-c7ee-4104-a623-3440f25999fc" -> null
        # (1 unchanged attribute hidden)
    }

  # module.suspension-service[0].aws_kms_key.repo_incoming will be destroyed
  # (because module.suspension-service[0] is not in configuration)
  - resource "aws_kms_key" "repo_incoming" {
      - arn                      = "arn:aws:kms:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:key/8b7c08da-c7ee-4104-a623-3440f25999fc" -> null
      - customer_master_key_spec = "SYMMETRIC_DEFAULT" -> null
      - description              = "Custom KMS Key to enable server side encryption for repo incoming topic" -> null
      - enable_key_rotation      = true -> null
      - id                       = "8b7c08da-c7ee-4104-a623-3440f25999fc" -> null
      - is_enabled               = true -> null
      - key_id                   = "8b7c08da-c7ee-4104-a623-3440f25999fc" -> null
      - key_usage                = "ENCRYPT_DECRYPT" -> null
      - multi_region             = false -> null
      - policy                   = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:root"
                        }
                      - Resource  = "*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = [
                          - "kms:GenerateDataKey*",
                          - "kms:Decrypt",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "sns.amazonaws.com"
                        }
                      - Resource  = "*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = [
                          - "kms:GenerateDataKey*",
                          - "kms:Decrypt",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudwatch.amazonaws.com"
                        }
                      - Resource  = "*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - rotation_period_in_days  = 365 -> null
      - tags                     = {
          - "CreatedBy"   = "suspension-service"
          - "Environment" = "dev"
          - "Name"        = "dev-repo-incoming-kms-key"
        } -> null
      - tags_all                 = {
          - "CreatedBy"   = "suspension-service"
          - "Environment" = "dev"
          - "Name"        = "dev-repo-incoming-kms-key"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.suspension-service[0].aws_lambda_function.lambda will be destroyed
  # (because module.suspension-service[0] is not in configuration)
  - resource "aws_lambda_function" "lambda" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:function:dev_orc_ingestion" -> null
      - code_sha256                    = "z0EpdZpiB+WDtVLFmX8Asr5l2Vp4fm09pG9HzZ1a8PY=" -> null
      - filename                       = "./../../../lambdas/orc-ingestion-lambda/build/orc_ingestion_payload.zip" -> null
      - function_name                  = "dev_orc_ingestion" -> null
      - handler                        = "orc_ingestion.lambda_handler" -> null
      - id                             = "dev_orc_ingestion" -> null
      - invoke_arn                     = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:function:dev_orc_ingestion/invocations" -> null
      - last_modified                  = "2025-12-05T16:47:22.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:function:dev_orc_ingestion:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:function:dev_orc_ingestion:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "[REDACTED_IAM_ROLE_ARN]" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "z0EpdZpiB+WDtVLFmX8Asr5l2Vp4fm09pG9HzZ1a8PY=" -> null
      - source_code_size               = 1340 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 30 -> null
      - version                        = "$LATEST" -> null
        # (6 unchanged attributes hidden)

      - environment {
          - variables = {
              - "INGEST_FILE_NAME"     = "Patient-List-Test"
              - "S3_BUCKET_NAME"       = "dev-ehr-ingestion"
              - "SUSPENSION_QUEUE_URL" = "https://sqs.eu-west-2.amazonaws.com/[REDACTED_AWS_ACCOUNT_ID]/dev-suspension-service-suspensions"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/dev_orc_ingestion" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.suspension-service[0].aws_s3_bucket.ingestion_bucket will be destroyed
  # (because module.suspension-service[0] is not in configuration)
  - resource "aws_s3_bucket" "ingestion_bucket" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::dev-ehr-ingestion" -> null
      - bucket                      = "dev-ehr-ingestion" -> null
      - bucket_domain_name          = "dev-ehr-ingestion.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "dev-ehr-ingestion.s3.eu-west-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3GKZC51ZF0DB4" -> null
      - id                          = "dev-ehr-ingestion" -> null
      - object_lock_enabled         = false -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::dev-ehr-ingestion/*"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - region                      = "eu-west-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Environment" = "dev"
          - "Name"        = "dev-ehr-ingestion"
        } -> null
      - tags_all                    = {
          - "Environment" = "dev"
          - "Name"        = "dev-ehr-ingestion"
        } -> null
        # (2 unchanged attributes hidden)

      - grant {
          - id          = "3f6b2d08c7bc553aa2d61e31d[REDACTED_AWS_ACCOUNT_ID]b584b0869384c7e72699f5094f6" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - logging {
          - target_bucket = "dev-orc-access-logs" -> null
          - target_prefix = "dev-ehr-ingestion/" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.suspension-service[0].aws_s3_bucket_logging.ingestion_bucket will be destroyed
  # (because module.suspension-service[0] is not in configuration)
  - resource "aws_s3_bucket_logging" "ingestion_bucket" {
      - bucket                = "dev-ehr-ingestion" -> null
      - id                    = "dev-ehr-ingestion" -> null
      - target_bucket         = "dev-orc-access-logs" -> null
      - target_prefix         = "dev-ehr-ingestion/" -> null
        # (1 unchanged attribute hidden)
    }

  # module.suspension-service[0].aws_s3_bucket_policy.ingestion_bucket_policy will be destroyed
  # (because module.suspension-service[0] is not in configuration)
  - resource "aws_s3_bucket_policy" "ingestion_bucket_policy" {
      - bucket = "dev-ehr-ingestion" -> null
      - id     = "dev-ehr-ingestion" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::dev-ehr-ingestion/*"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
    }

  # module.suspension-service[0].aws_s3_bucket_public_access_block.ingestion_bucket will be destroyed
  # (because module.suspension-service[0] is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "ingestion_bucket" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "dev-ehr-ingestion" -> null
      - id                      = "dev-ehr-ingestion" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.suspension-service[0].aws_s3_bucket_server_side_encryption_configuration.ingestion_bucket will be destroyed
  # (because module.suspension-service[0] is not in configuration)
  - resource "aws_s3_bucket_server_side_encryption_configuration" "ingestion_bucket" {
      - bucket                = "dev-ehr-ingestion" -> null
      - id                    = "dev-ehr-ingestion" -> null
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm     = "AES256" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.suspension-service[0].aws_sns_topic.repo_incoming will be destroyed
  # (because module.suspension-service[0] is not in configuration)
  - resource "aws_sns_topic" "repo_incoming" {
      - application_success_feedback_sample_rate = 0 -> null
      - arn                                      = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-repo-incoming" -> null
      - content_based_deduplication              = false -> null
      - fifo_topic                               = false -> null
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      - id                                       = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-repo-incoming" -> null
      - kms_master_key_id                        = "8b7c08da-c7ee-4104-a623-3440f25999fc" -> null
      - lambda_success_feedback_sample_rate      = 0 -> null
      - name                                     = "dev-suspension-service-repo-incoming" -> null
      - owner                                    = "[REDACTED_AWS_ACCOUNT_ID]" -> null
      - policy                                   = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                          - "SNS:Receive",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "[REDACTED_AWS_ACCOUNT_ID]"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
      
(truncated - see workflow logs for full output)
```

</details>